---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetDocument
source: html/ced60288-464b-76e1-8d85-49b691c04a5f.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetDocument Method

Gets a reference to the current document.

## Syntax (C#)
```csharp
public Document GetDocument()
```

## Returns
Returns a reference to the current document.